[
  {
    "path": "posts/lost_aufenthaltstitel/",
    "title": "Lost your `Aufenthaltstitel` / `Residence Perimt` in Germany? ",
    "description": "Hello! As an experienced-loser of German `Residence Permit`s and wallets, I am gonna quickly walk through what it is you need to do as of 2020 to re-apply for one",
    "author": [
      {
        "name": "Harithaa",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2020-12-20",
    "categories": [],
    "contents": "\n\n\n\ntl;dr version\nOnce you have established that you have definitely lost your wallet or whatever containing the Aufentshaltstitle or the residence permit, do the following:\nRegister a complaint at the Fundbüro (lost and found) of the city council and/or the place you likely lost your card at (maybe in the university campus or a cafeteria, etc.). The registration complaint at the Fundbüro of the city can also be done online. There is a very high likelihood that it might be found/given there if the city/town you lost it in is small or a student town.\nNext, to re-apply for the residence permit you need to go a Police station and file a complaint and get a document known as Verlustanzeige, which officially states that you have lost your card at a certain place and time. To do this, take along with you your passport and student ID (if a student) and a German speaking friend if your German is inadequate.\nSend this Verlustanzeige by email to your person-in-charge at the Ausländerbehörde (foreigner’s office that issued you your Residence Permit in the first place) and explain in detail.\nThen, they will issue a temporary residence permit Aufenthaltsfiktion, which gives you the legal rights to stay, and then you go over the process of re-applying for your residence permit as before (you will again have to pay for the new permit).\nAlso take note of any other cards that were lost in this process (if it was a wallet that was lost), cancel all the bank cards and inform the health insurance and the usual.\n\nAll of this is ONLY based on my personal experience and was valid in 2020, I do not hold responsibility for this being future-proof or working in your situation. I would first write to the Ausländerbehörde to be sure of what to do.\n\n\n\n\n",
    "preview": "posts/lost_aufenthaltstitel/crayon-1650.png",
    "last_modified": "2021-01-01T17:52:55+01:00",
    "input_file": "welcome.utf8.md",
    "preview_width": 828,
    "preview_height": 912
  }
]
