[
  {
    "path": "posts/2020-12-20-customary-made-a-website-post/",
    "title": "Customary 'made a Website' post!",
    "description": "I made a website?",
    "author": [
      {
        "name": "Harithaa",
        "url": {}
      }
    ],
    "date": "2020-12-20",
    "categories": [],
    "contents": "\nHello World!\nHello world of the websites has been made by me.\n\n\n\n",
    "preview": {},
    "last_modified": "2020-12-20T21:16:11+01:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Command Line Biologist",
    "description": "Welcome to our new blog, Command Line Biologist. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Harithaa",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2020-12-20",
    "categories": [],
    "contents": "\nDedicated Learning Time\nI’ve found it really hard when I’m under the pump to make time to learn new things. Even if I can see those things have the capacity to make me more productive on a project. It’s like I find learning too enjoyable to be work.\nMy response to this realisation was to dedicate the first 30 minutes of my work day to reading, working through examples, or watching videos I have been meaning to get to but have been getting knocked down in my queue by higher priority work.\nI started doing this in my lull after useR and I found the thought of getting to work to spend some time learning helped provide the motivation in the morning I was otherwise struggling for.\nSince doing this I have heard other people talking about this kind of idea. This week Jessie Roberts described to me a similar plan to dedicate 30min each day to things that are ‘important but not urgent’. I like that way of framing it. The forward planning from Lucy’s method seems like exactly this.\nThe Viminning\nNow this is where things get qutie nerdy. My new confidence with typing kicked off an interest in keyboard shortcuts which blossomed into a fully fledged obsession with trying to control as much of my computer as possible with the keyboard.\nThe frustrating thing you’ll quickly find if you head down this path is that a lot of the applications you use will have their own unique keyboard shortcut conventions. There’s just too much to memorise. So over the past year I’ve been gradually replacing or configuring my applications so they all use a single control scheme - and that control scheme is inspired by vim.\nI think I’d better do a separate post on the rationale and the details, but here’s a tour:\nI control my desktop and its windows using a tiling window manager called i3. Window arrangement uses vim inspired keys (h,j,k,l).\nI write code using Spacemacs, which among other things, places a vim control scheme over Emacs (and ESS for R).\nI control my Chromium browser using an extension called ‘Vimium C’ that implements an amazingly faithful vim control scheme for a browser.1\nI launch applications with a launcher called rofi that uses a vim navigation scheme.\nI use a terminal file browser called ranger that has vim navigation and command scheme.\nSo what’s it like to have one unified(ish) keyboard control scheme for all your work tools? It feels fast and instinctive. I feel frustrated by a regular desktop setup now - like I can’t wait to get back to my vimland. Everything is sluggish and clunky by comparison 2.\nI don’t think this path is for everyone, but I do think everyone can benefit from reexamining the painful UIs in their life that they’ve normalised. Frustration and tension make us tired, susceptible to distraction, and give up prematurely. Giving up murders good ideas.\nMy tools: Spacemacs, Chromium, Ranger, and rofi in i3 window managerHello 2019 - Sorry I’m late\nThis year my resolution for my work is for less crunchy, more smooth. I’m changing jobs at the beginning of February and I hope to bring some of the planning tools I learned from Lucy in from the start, so that I never reach the peak workloads of 2018. Consequently I am looking forward to more worry free weekends with the family!\nAlso, I don’t think I am quite done with this ‘make everything vim’ idea. :P\n\nI made a fallback mode in i3 where I can operate my mouse pointer using vim keys for websites that force the issue - yes I am aware how crazy this sounds.↩︎\nThis might partly be due to dropping down the key repeat time for key presses - this is worth trying, trust me.↩︎\n",
    "preview": {},
    "last_modified": "2020-12-28T15:51:38+01:00",
    "input_file": {}
  }
]
